In [17]:
import pandas as pd
#import xlrd as xl

df = pd.read_csv('weather_data.csv')
df2 = pd.read_excel('weather_data.xlsx')
print(df)
print(df2)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny
        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [20]:
##write to a file

df.to_csv('new_weather_data.csv',index=False)

In [24]:
df2.to_excel('new_weather_data.xlsx',sheet_name='weather_data',index=False)

In [28]:
#### groupby()  function use

df = pd.read_csv('weather_data_cities.csv')
print(df)
g = df.groupby('city')

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001241C6D7F40>

In [32]:
for city,city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [33]:
### to print a specific group


g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [34]:
#### to print maximum of every group

print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [35]:
### mean()


print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [38]:
##### describe keyword

print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# concenating data frames

In [41]:
e = pd.DataFrame({'cities':[ 'badhalganj' , 'gopalganj' ,'mirjapur', 'kolhapur', 'mathura'],
                   'humidity':[32,45,30,25,40],
                   'temperature':[50,51,52,53,54]
                 })
e

       cities  humidity  temperature
0  badhalganj        32           50
1   gopalganj        45           51
2    mirjapur        30           52
3    kolhapur        25           53
4     mathura        40           54

In [42]:
f = pd.DataFrame({'cities':[ 'mirjapur', 'kolhapur', 'mathura'],
                   'humidity':[30,25,40],
                   'temperature':[52,53,54]
                 })
f

     cities  humidity  temperature
0  mirjapur        30           52
1  kolhapur        25           53
2   mathura        40           54

In [47]:
### column wise concatination


g = pd.concat([e,f],ignore_index=True)
g

       cities  humidity  temperature
0  badhalganj        32           50
1   gopalganj        45           51
2    mirjapur        30           52
3    kolhapur        25           53
4     mathura        40           54
5    mirjapur        30           52
6    kolhapur        25           53
7     mathura        40           54

In [49]:
#### row wise addition

g = pd.concat([e,f],axis=1)
g

       cities  humidity  temperature    cities  humidity  temperature
0  badhalganj        32           50  mirjapur      30.0         52.0
1   gopalganj        45           51  kolhapur      25.0         53.0
2    mirjapur        30           52   mathura      40.0         54.0
3    kolhapur        25           53       NaN       NaN          NaN
4     mathura        40           54       NaN       NaN          NaN

# merge data frames

In [50]:
f = pd.DataFrame({'cities':[ 'mirjapur', 'kolhapur', 'mathura'],
                   'humidity':[30,25,40]})
f

     cities  humidity
0  mirjapur        30
1  kolhapur        25
2   mathura        40

In [57]:
e = pd.DataFrame({'cities':[ 'mirjapur', 'kolhapur', 'mathura','sultanpur'],
                   'temperature':[50,51,40,45]})
e

      cities  temperature
0   mirjapur           50
1   kolhapur           51
2    mathura           40
3  sultanpur           45

In [58]:
### merge()function and on keyword use


df = pd.merge(e,f,on='cities')
df

     cities  temperature  humidity
0  mirjapur           50        30
1  kolhapur           51        25
2   mathura           40        40

In [59]:
### to include all rows use of how="outer"

df = pd.merge( e, f, on='cities', how='outer')
df

      cities  temperature  humidity
0   mirjapur           50      30.0
1   kolhapur           51      25.0
2    mathura           40      40.0
3  sultanpur           45       NaN

In [63]:
####numerical indexing




df = pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[48,49,47,46,45,44,42,1,2,3])
df

     0
48   1
49   2
47   3
46   4
45   5
44   6
42   7
1    8
2    9
3   10

In [70]:
print(df.loc[46])                  #particular index
print("*********************")
print(df.loc[:46])                #till an index

0    4
Name: 46, dtype: int64
*********************
    0
48  1
49  2
47  3
46  4

In [67]:
df.iloc[:5]

    0
48  1
49  2
47  3
46  4
45  5